Revit 2027 API
Application.NewElementId Method
Creates a new Autodesk::Revit::DB::ElementId^ object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NewElementId()
Public Function NewElementId As ElementId
public:
ElementId^ NewElementId()
member NewElementId : unit -> ElementId
Return Value
ElementId
The new Autodesk::Revit::DB::ElementId^ object.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace